betaflight/betaflight/src/platform/common/stm32/bus_spi_pinconfig.c
        },
        .misoPins = {
            { DEFIO_TAG_E(PA12),  GPIO_MUX_5},
            { DEFIO_TAG_E(PB14),  GPIO_MUX_5},
            { DEFIO_TAG_E(PC2),   GPIO_MUX_5},
            { DEFIO_TAG_E(PD3),   GPIO_MUX_6},
        },
        .mosiPins = {
            { DEFIO_TAG_E(PB15),  GPIO_MUX_5},
            { DEFIO_TAG_E(PC1),   GPIO_MUX_7},
            { DEFIO_TAG_E(PC3),   GPIO_MUX_5},
            { DEFIO_TAG_E(PD4),   GPIO_MUX_6},
        },
        .rcc = RCC_APB1(SPI2),
    },
    {
        .device = SPIDEV_3,
        .reg = (spiResource_t *)SPI3,
        .sckPins = {
            { DEFIO_TAG_E(PB3),  GPIO_MUX_6},
            { DEFIO_TAG_E(PB12), GPIO_MUX_7},
            { DEFIO_TAG_E(PC10), GPIO_MUX_6},
        },
        .misoPins = {
            { DEFIO_TAG_E(PB4),  GPIO_MUX_6},
            { DEFIO_TAG_E(PC11), GPIO_MUX_6},
        },
        .mosiPins = {
            { DEFIO_TAG_E(PB0),  GPIO_MUX_7},
            { DEFIO_TAG_E(PB2),  GPIO_MUX_7},
            { DEFIO_TAG_E(PB5),  GPIO_MUX_6},
            { DEFIO_TAG_E(PC12),  GPIO_MUX_6},
            { DEFIO_TAG_E(PD0),  GPIO_MUX_6},
        },
        .rcc = RCC_APB1(SPI3),
    },
    {
        .device = SPIDEV_4,
        .reg = (spiResource_t *)SPI4,
        .sckPins = {
            { DEFIO_TAG_E(PB7),  GPIO_MUX_6},
            { DEFIO_TAG_E(PB13), GPIO_MUX_6},
        },
        .misoPins = {
            { DEFIO_TAG_E(PA11),  GPIO_MUX_6},
            { DEFIO_TAG_E(PB8) ,  GPIO_MUX_6},
            { DEFIO_TAG_E(PD0) ,  GPIO_MUX_5},
        },
        .mosiPins = {
            { DEFIO_TAG_E(PA1),   GPIO_MUX_5},
            { DEFIO_TAG_E(PB9),   GPIO_MUX_6},
        },
        .rcc = RCC_APB2(SPI4),
    },
#endif
#ifdef APM32F4
    {
        .device = SPIDEV_1,
        .reg = (spiResource_t *)SPI1,
        .sckPins = {
            { DEFIO_TAG_E(PA5), GPIO_AF5_SPI1 },
            { DEFIO_TAG_E(PB3), GPIO_AF5_SPI1 },
        },
        .misoPins = {
            { DEFIO_TAG_E(PA6), GPIO_AF5_SPI1 },
            { DEFIO_TAG_E(PB4), GPIO_AF5_SPI1 },
        },
        .mosiPins = {
            { DEFIO_TAG_E(PA7), GPIO_AF5_SPI1 },
            { DEFIO_TAG_E(PB5), GPIO_AF5_SPI1 },
        },
        .rcc = RCC_APB2(SPI1),
        .dmaIrqHandler = DMA2_ST3_HANDLER,
    },
    {
        .device = SPIDEV_2,
        .reg = (spiResource_t *)SPI2,
        .sckPins = {
            { DEFIO_TAG_E(PB10), GPIO_AF5_SPI2 },
            { DEFIO_TAG_E(PB13), GPIO_AF5_SPI2 },
        },
        .misoPins = {
            { DEFIO_TAG_E(PC2), GPIO_AF5_SPI2 },
            { DEFIO_TAG_E(PB14), GPIO_AF5_SPI2 },
        },
        .mosiPins = {
            { DEFIO_TAG_E(PC3), GPIO_AF5_SPI2 },
            { DEFIO_TAG_E(PB15), GPIO_AF5_SPI2 },
        },
        .rcc = RCC_APB1(SPI2),
        .dmaIrqHandler = DMA1_ST4_HANDLER,
    },
    {
        .device = SPIDEV_3,
        .reg = (spiResource_t *)SPI3,
        .sckPins = {
            { DEFIO_TAG_E(PB3), GPIO_AF6_SPI3 },
            { DEFIO_TAG_E(PC10), GPIO_AF6_SPI3 },
        },
        .misoPins = {
            { DEFIO_TAG_E(PB4), GPIO_AF6_SPI3 },
            { DEFIO_TAG_E(PC11), GPIO_AF6_SPI3 },
        },
        .mosiPins = {
            { DEFIO_TAG_E(PB5), GPIO_AF6_SPI3 },
            { DEFIO_TAG_E(PC12), GPIO_AF6_SPI3 },
        },
        .rcc = RCC_APB1(SPI3),
        .dmaIrqHandler = DMA1_ST7_HANDLER,
    },
#endif
#ifdef X32M7

    #ifdef USE_SPI_DEVICE_1
    [SPIDEV_1] = {
        .device = SPIDEV_1,
        .reg = (spiResource_t *)SPI1,
        .sckPins = {
            { DEFIO_TAG_E(PA5), GPIO_AF4 },
            { DEFIO_TAG_E(PB3), GPIO_AF1 },
            { DEFIO_TAG_E(PG11), GPIO_AF6 },
        },
        .misoPins = {
            { DEFIO_TAG_E(PA6), GPIO_AF4 },
            { DEFIO_TAG_E(PB4), GPIO_AF2 },
            { DEFIO_TAG_E(PG9), GPIO_AF5 },
        },
        .mosiPins = {
            { DEFIO_TAG_E(PA7), GPIO_AF5 },
            { DEFIO_TAG_E(PD7), GPIO_AF3 },
        },
        .rcc = RCC_APB2_2(SPI1),
    },
    #endif
    #ifdef USE_SPI_DEVICE_2
    [SPIDEV_2] = {
            .device = SPIDEV_2,
            .reg = (spiResource_t *)SPI2,
            .sckPins = {
                { DEFIO_TAG_E(PA9), GPIO_AF3 },
                { DEFIO_TAG_E(PB10), GPIO_AF4 },
                { DEFIO_TAG_E(PB13), GPIO_AF4 },
                { DEFIO_TAG_E(PD3), GPIO_AF4 },
                { DEFIO_TAG_E(PI1), GPIO_AF6 },
            },
            .misoPins = {
                { DEFIO_TAG_E(PB14), GPIO_AF4 },
                { DEFIO_TAG_E(PC2), GPIO_AF6 },
                { DEFIO_TAG_E(PI2), GPIO_AF5 },
            },
            .mosiPins = {
                { DEFIO_TAG_E(PB15), GPIO_AF4 },
                { DEFIO_TAG_E(PC1), GPIO_AF4 },
                { DEFIO_TAG_E(PC3), GPIO_AF6 },
                { DEFIO_TAG_E(PI3), GPIO_AF5 },
            },
            .rcc = RCC_APB2_2(SPI2),
        },
    #endif
    #ifdef USE_SPI_DEVICE_3
    [SPIDEV_3] = {
            .device = SPIDEV_3,
            .reg = (spiResource_t *)SPI3,
            .sckPins = {
                { DEFIO_TAG_E(PB3), GPIO_AF2 },
                { DEFIO_TAG_E(PC10), GPIO_AF5 },
                { DEFIO_TAG_E(PD7), GPIO_AF4 },
            },
            .misoPins = {
                { DEFIO_TAG_E(PB1), GPIO_AF6 },
                { DEFIO_TAG_E(PB4), GPIO_AF4 },
                { DEFIO_TAG_E(PC11), GPIO_AF4 },
                { DEFIO_TAG_E(PD5), GPIO_AF4 },
            },
            .mosiPins = {
                { DEFIO_TAG_E(PB2), GPIO_AF6 },
                { DEFIO_TAG_E(PC12), GPIO_AF5 },
                { DEFIO_TAG_E(PD6), GPIO_AF5 },
            },
            .rcc = RCC_APB1_2(SPI3),
        },
    #endif
    #ifdef USE_SPI_DEVICE_4
    [SPIDEV_4] = {
            .device = SPIDEV_4,
            .reg = (spiResource_t *)SPI4,
            .sckPins = {
                { DEFIO_TAG_E(PA5), GPIO_AF5 },
                { DEFIO_TAG_E(PB3), GPIO_AF3 },
                { DEFIO_TAG_E(PC12), GPIO_AF6 },
                { DEFIO_TAG_E(PG13), GPIO_AF5 },
            },
            .misoPins = {
                { DEFIO_TAG_E(PA6), GPIO_AF5 },
                { DEFIO_TAG_E(PB4), GPIO_AF5 },
                { DEFIO_TAG_E(PG12), GPIO_AF7 },
            },
            .mosiPins = {
                { DEFIO_TAG_E(PA7), GPIO_AF6 },
                { DEFIO_TAG_E(PG14), GPIO_AF6 },
            },
            .rcc = RCC_APB5_1(SPI4),
        },
    #endif
    #ifdef USE_SPI_DEVICE_5
    [SPIDEV_5] = {
            .device = SPIDEV_5,
            .reg = (spiResource_t *)SPI5,
            .sckPins = {
                { DEFIO_TAG_E(PF7), GPIO_AF4 },
                { DEFIO_TAG_E(PH6), GPIO_AF5 },
            },
            .misoPins = {
                { DEFIO_TAG_E(PF8), GPIO_AF5 },
                { DEFIO_TAG_E(PH7), GPIO_AF4 },
                { DEFIO_TAG_E(PJ11), GPIO_AF3 },
            },
            .mosiPins = {
                { DEFIO_TAG_E(PF9), GPIO_AF5 },
                { DEFIO_TAG_E(PF11), GPIO_AF3 },
                { DEFIO_TAG_E(PJ10), GPIO_AF3 },
            },
            .rcc = RCC_APB5_1(SPI5),
        },
    #endif
    #ifdef USE_SPI_DEVICE_6
    [SPIDEV_6] = {
            .device = SPIDEV_6,
            .reg = (spiResource_t *)SPI6,
            .sckPins = {
                { DEFIO_TAG_E(PE2), GPIO_AF4 },
                { DEFIO_TAG_E(PE12), GPIO_AF5 },
                { DEFIO_TAG_E(PF3), GPIO_AF5 },
            },
            .misoPins = {
                { DEFIO_TAG_E(PE5), GPIO_AF4 },
                { DEFIO_TAG_E(PE13), GPIO_AF4 },
                { DEFIO_TAG_E(PF4), GPIO_AF6 },
            },
            .mosiPins = {
                { DEFIO_TAG_E(PE6), GPIO_AF3 },
                { DEFIO_TAG_E(PE14), GPIO_AF5 },
                { DEFIO_TAG_E(PF5), GPIO_AF5 },
            },
            .rcc = RCC_APB5_1(SPI6),
        },
    #endif
    #ifdef USE_SPI_DEVICE_7
    [SPIDEV_7] = {
            .device = SPIDEV_7,
            .reg = (spiResource_t *)SPI7,
            .sckPins = {
                { DEFIO_TAG_E(PI8), GPIO_AF3 },
                { DEFIO_TAG_E(PJ1), GPIO_AF4 },
            },
            .misoPins = {
                { DEFIO_TAG_E(PH14), GPIO_AF5 },
                { DEFIO_TAG_E(PI13), GPIO_AF4 },
                { DEFIO_TAG_E(PJ3), GPIO_AF3 },
            },
            .mosiPins = {
                { DEFIO_TAG_E(PH15), GPIO_AF5 },
                { DEFIO_TAG_E(PI14), GPIO_AF4 },
                { DEFIO_TAG_E(PJ4), GPIO_AF3 },
            },
            .rcc = RCC_APB5_1(SPI7),
        },
    #endif
#endif

};

void spiPinConfigure(const spiPinConfig_t *pConfig)
{
    for (size_t hwindex = 0 ; hwindex < ARRAYLEN(spiHardware) ; hwindex++) {
        const spiHardware_t *hw = &spiHardware[hwindex];

        if (!hw->reg) {
            continue;
        }

        const spiDevice_e device = hw->device;
        spiDevice_t *pDev = &spiDevice[device];

        for (int pindex = 0 ; pindex < MAX_SPI_PIN_SEL ; pindex++) {
            if (pConfig[device].ioTagSck == hw->sckPins[pindex].pin) {
                pDev->sck = hw->sckPins[pindex].pin;
#if SPI_TRAIT_AF_PIN
                pDev->sckAF = hw->sckPins[pindex].af;
#endif
            }
            if (pConfig[device].ioTagMiso == hw->misoPins[pindex].pin) {
                pDev->miso = hw->misoPins[pindex].pin;
#if SPI_TRAIT_AF_PIN
                pDev->misoAF = hw->misoPins[pindex].af;
#endif
            }
            if (pConfig[device].ioTagMosi == hw->mosiPins[pindex].pin) {
                pDev->mosi = hw->mosiPins[pindex].pin;
#if SPI_TRAIT_AF_PIN
                pDev->mosiAF = hw->mosiPins[pindex].af;
#endif
            }
        }

        if (pDev->sck && pDev->miso && pDev->mosi) {
            pDev->dev = hw->reg;
#if SPI_TRAIT_AF_PORT
            pDev->af = hw->af;
#endif
            pDev->rcc = hw->rcc;
            pDev->leadingEdge = false; // XXX Should be part of transfer context
#if defined(USE_DMA) && defined(USE_HAL_DRIVER)
            pDev->dmaIrqHandler = hw->dmaIrqHandler;
#endif
        }
    }
}
#endif
